NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A020F1024IM48.svd
        <register>
          <name>CFG1</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7BCF887F</resetMask>
          <fields>
            <field>
              <name>DBGHALT</name>
              <description>Debug halt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Continue normal EUSART operation even if core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>If core is halted, receive one frame and then halt reception by deactivating RTS. Next frame reception happens when the core is unhalted during single stepping.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSINV</name>
              <description>Clear-to-send Invert Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The CTS pin is active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The CTS pin is active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSEN</name>
              <description>Clear-to-send Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Ignore CTS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Stop transmitting when CTS is inactive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTSINV</name>
              <description>Request-to-send Invert Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The RTS pin is active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The RTS pin is active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTIMEOUT</name>
              <description>RX Timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEFRAME</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOFRAMES</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREEFRAMES</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURFRAMES</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVEFRAMES</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXFRAMES</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENFRAMES</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFUBRX</name>
              <description>Start Frame Unblock Receiver</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPRSEN</name>
              <description>PRS RX Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIW</name>
              <description>TX FIFO Interrupt Watermark</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEFRAME</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least one more frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least two more frames.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREEFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least three more frames.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least four more frames. </description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVEFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least five more frames. </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least six more frames. </description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least seven more frames. </description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least eight more frames. </description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINEFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least nine more frames. </description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least ten more frames. </description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least eleven more frames. </description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVEFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least twelve more frames. </description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least thriteen more frames. </description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least fourteen more frames. </description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least fifteen more frames. </description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEENFRAMES</name>
                  <description>TXFL status flag and IF are set when the TX FIFO has space for at least sixteen more frames. </description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTSRXFW</name>
              <description>Request-to-send RX FIFO Watermark</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEFRAME</name>
                  <description>RTS is set if there is space for at least one more frame in the RX FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOFRAMES</name>
                  <description>RTS is set if there is space for at least two more frames in the RX FIFO.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREEFRAMES</name>
                  <description>RTS is set if there is space for at least three more frames in the RX FIFO.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURFRAMES</name>
                  <description>RTS is set if there is space for four more frames in the RX FIFO.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVEFRAMES</name>
                  <description>RTS is set if there is space for five more frames in the RX FIFO.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXFRAMES</name>
                  <description>RTS is set if there is space for six more frames in the RX FIFO.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENFRAMES</name>
                  <description>RTS is set if there is space for seven more frames in the RX FIFO.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTFRAMES</name>
                  <description>RTS is set if there is space for eight more frames in the RX FIFO.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINEFRAMES</name>
                  <description>RTS is set if there is space for nine more frames in the RX FIFO.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TENFRAMES</name>
                  <description>RTS is set if there is space for ten more frames in the RX FIFO.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVENFRAMES</name>
                  <description>RTS is set if there is space for eleven more frames in the RX FIFO.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVEFRAMES</name>
                  <description>RTS is set if there is space for twelve more frames in the RX FIFO.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEENFRAMES</name>
                  <description>RTS is set if there is space for thirteen more frames in the RX FIFO.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEENFRAMES</name>
                  <description>RTS is set if there is space for fourteen more frames in the RX FIFO.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEENFRAMES</name>
                  <description>RTS is set if there is space for fifteen more frames in the RX FIFO.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEENFRAMES</name>
                  <description>RTS is set if there is space for sixteen more frames in the RX FIFO.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIW</name>
              <description>RX FIFO Interrupt Watermark</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEFRAME</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least one frame in it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least two frames in it.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREEFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least three frames in it.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least four frames in it.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVEFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least five frames in it. </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least six frames in it. </description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least seven frames in it. </description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least eight frames in it. </description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINEFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least nine frames in it. </description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least ten frames in it. </description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least eleven frames in it. </description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVEFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least twelve frames in it. </description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least thriteen frames in it. </description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least fourteen frames in it. </description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least fifteen frames in it. </description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEENFRAMES</name>
                  <description>RXFL status flag and IF are set when the RX FIFO has at least sixteen frames in it. </description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
